[
  {
    "f_id": 0,
    "f_name": "Actor",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Skilled at mimicry and dramatics, you gain the following benefits:<ul><li>Increase your Charisma score by 1, to a maximum of 20.</li><li>You have advantage on Charisma (Deception) and Charisma (Performance) checks when trying to pass yourself off as a different person.</li><li>You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine that the effect is faked.</li></ul></p>"
  },
  {
    "f_id": 1,
    "f_name": "Alert",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Always on the lookout for danger, you gain the following benefits:<ul><li>You gain a +5 bonus to initiative.</li><li>You can’t be surprised while you are conscious.</li><li>Other creatures don’t gain advantage on attack rolls against you as a result of being hidden from you.</li></ul></p>"
  },
  {
    "f_id": 2,
    "f_name": "Athlete",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have undergone extensive physical training to gain the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>When you are prone, standing up uses only 5 feet of your movement.</li><li>Climbing doesn’t halve your speed.</li><li>You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet.</li></ul></p>"
  },
  {
    "f_id": 3,
    "f_name": "Barbed Hide",
    "f_prerequisite_race": "Tiefling",
    "f_prerequisite_skill": "None",
    "f_description": "<p>One of your ancestors was a barbed devil or other spiky fiend. Barbs protrude from your head. You gain the following benefits:<ul><li>Increase your Constitution or Charisma score by 1, up to a maximum of 20.</li><li>As a bonus action, you can cause small barbs to protrude all over your body or cause them to retract. At the start of each of your turns while the barbs are out, you deal 1d6 piercing damage to any creature grappling you or any creature grappled by you.</li><li>You gain proficiency in the Intimidation skill. If you’re already proficient in it, your proficiency bonus is doubled for any check you make with it.</li></ul></p>"
  },
  {
    "f_id": 4,
    "f_name": "Bountiful Luck",
    "f_prerequisite_race": "Halfling",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your people have extraordinary luck, which you have learned to mystically lend to your companions when you see them falter. You’re not sure how you do it; you just wish it, and it happens. Surely a sign of fortune’s favor! When an ally you can see within 30 feet of you rolls a 1 on the d20 for an attack roll, an ability check, or a saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll. When you use this ability, you can’t use your Lucky racial trait before the end of your next turn.</p>"
  },
  {
    "f_id": 5,
    "f_name": "Charger",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature. If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack’s damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed).</p>"
  },
  {
    "f_id": 6,
    "f_name": "Critter Friend",
    "f_prerequisite_race": "Forest Gnome",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your friendship with animals mystically deepens. You gain the following benefits:<ul><li>You gain proficiency in the Animal Handling skill. If you’re already proficient in it, your proficiency bonus is doubled for any check you make with it.</li><li>You learn the speak with animals spell and can cast it at will, without expending a spell slot. You also learn the animal friendship spell, and you can cast it once with this feat, without expending a spell slot. You regain the ability to cast it in this way when you finish a long rest. Intelligence is your spellcasting ability for these spells.</li></ul></p>"
  },
  {
    "f_id": 7,
    "f_name": "Crossbow Expert",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Thanks to extensive practice with the crossbow, you gain the following benefits:<ul><li>You ignore the loading quality of crossbows with which you are proficient.</li><li>Being within 5 feet of a hostile creature doesn’t impose disadvantage on your ranged attack rolls.</li><li>When you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a loaded hand crossbow you are holding.</li></ul></p>"
  },
  {
    "f_id": 8,
    "f_name": "Defensive Duelist",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Dexterity 13 or higher",
    "f_description": "<p>When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you.</p>"
  },
  {
    "f_id": 9,
    "f_name": "Dragon Fear",
    "f_prerequisite_race": "Dragonborn",
    "f_prerequisite_skill": "None",
    "f_description": "<p>When angered, you radiate menace. You gain the following benefits:<ul><li>Increase your Strength, Constitution or Charisma score by 1, up to a maximum of 20.</li><li>Instead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 30 feet of you to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Charisma modifier). A target automatically succeeds if it can’t hear or see you. On a failed save, a target becomes frightened of you for 1 minute. If the frightened target takes any damage, it can repeat the saving throw, ending the effect on itself on a success.</li></ul></p>"
  },
  {
    "f_id": 10,
    "f_name": "Dragon Hide",
    "f_prerequisite_race": "Dragonborn",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You manifest scales and claws reminiscent of your draconic ancestors. You gain the following benefits:<ul><li>Increase your Strength, Constitution or Charisma score by 1, up to a maximum of 20.</li><li>Your scales harden. While you aren’t wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a shield and still gain this benefit.</li><li>You grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike.</li></ul></p>"
  },
  {
    "f_id": 11,
    "f_name": "Dragon Wings",
    "f_prerequisite_race": "Dragonborn",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You sprout draconic wings. With your wings, you have a flying speed of 20 feet if you aren’t wearing heavy armor and aren’t exceeding your carrying capacity.</p>"
  },
  {
    "f_id": 12,
    "f_name": "Drow High Magic",
    "f_prerequisite_race": "Drow Elf",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You learn more of the spells typical for your people. You learn detect magic and can cast it at will, without expending a spell slot. You also learn levitate and dispel magic, each of which you can cast once without expending a spell slot. You regain the ability to cast the spell in this way when you finish a long rest. Charisma is your spellcasting ability for these spells.</p>"
  },
  {
    "f_id": 13,
    "f_name": "Dual Wielder",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You master fighting with two weapons, gaining the following benefits:<ul><li>You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.</li><li>You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren’t light.</li><li>You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.</li></ul></p>"
  },
  {
    "f_id": 14,
    "f_name": "Dungeon Delver",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:<ul><li>When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).</li><li>You have advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors.</li><li>You have advantage on saving throws made to avoid or resist traps.</li><li>You have resistance to the damage dealt by traps.</li><li>You can search for traps while travelling at a normal pace, instead of only at a slow pace.</li></ul></p>"
  },
  {
    "f_id": 15,
    "f_name": "Durable",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Hardy and resilient, you gain the following benefits:<ul><li>Increase your Constitution score by 1, to a maximum of 20.</li><li>When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).</li></ul></p>"
  },
  {
    "f_id": 16,
    "f_name": "Dwarven Fortitude",
    "f_prerequisite_race": "Dwarf",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have the blood of dwarf heroes flowing through your veins. You gain the following benefits:<ul><li>Increase your Constitution score by 1, up to a maximum of 20.</li><li>Whenever you take the Dodge action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1).</li></ul></p>"
  },
  {
    "f_id": 17,
    "f_name": "Elemental Adept",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "The ability to cast at least one spell",
    "f_description": "<p>When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder. Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2. You can select this feat multiple times. Each time you do so, you must choose a different damage type.</p>"
  },
  {
    "f_id": 18,
    "f_name": "Elven Accuracy",
    "f_prerequisite_race": [
      "Elf",
      "Half Elf"
    ],
    "f_prerequisite_skill": "None",
    "f_description": "<p>The accuracy of elves is legendary, especially that of elf archers and spellcasters. You have uncanny aim with attacks that rely on precision rather than brute force. You gain the following benefits:<ul><li>Increase your Dexterity, Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li><li>Whenever you have advantage on an attack roll using Dexterity, Intelligence, Wisdom, or Charisma, you can reroll one of the dice once.</li></ul></p>"
  },
  {
    "f_id": 19,
    "f_name": "Everybody's Friend",
    "f_prerequisite_race": "Half Elf",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You develop your magnetic personality to ease your way through the world. You gain the following benefits:<ul><li>Increase your Charisma score by 1, up to a maximum of 20.</li><li>You gain proficiency in the Deception and Persuasion skills. If you’re already proficient in either skill, your proficiency bonus is doubled for any check you make with that skill.</li></ul></p>"
  },
  {
    "f_id": 20,
    "f_name": "Fade Away",
    "f_prerequisite_race": "Gnome",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your people are Clever, with a knack for illusion magic. You have learned a magical trick for fading away when you suffer harm. You gain the following benefits:<ul><li>Increase your Dexterity or Intelligence score by 1, to a maximum of 20.</li><li>Immediately after you take damage, you can use a reaction to magically become invisible until the end of your next turn or until you attack, deal damage, or force someone to make a saving throw. Once you use this ability, you can’t do so again until you finish a short or long rest.</li></ul></p>"
  },
  {
    "f_id": 21,
    "f_name": "Fey Teleportation",
    "f_prerequisite_race": "High Elf",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your study of high elven lore has unlocked fey power that few other elves possess, except your eladrin cousins. Drawing on your fey ancestry, you can momentarily stride through the Feywild to shorten your path from one place to another. You gain the following benefits:<ul><li>Increase your Intelligence or Charisma score by 1, to a maximum of 20.</li><li>You learn to speak, read, and write Sylvan.</li><li>You learn the misty step spell and can cast it once without expending a spell slot. You regain the ability to cast it in this way when you finish a short or long rest. Intelligence is your spellcasting ability for this spell.</li></ul></p>"
  },
  {
    "f_id": 22,
    "f_name": "Flames of Phlegethos",
    "f_prerequisite_race": "Tiefling",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You learn to call on hellfire to serve your commands. You gain the following benefits:<ul><li>Increase your Intelligence or Charisma score by 1, to a maximum of 20.</li><li>When you roll fire damage for a spell you cast, you can reroll any roll of 1 on the fire damage dice, but you must use the new roll, even if it is another 1.</li><li>Whenever you cast a spell that deals fire damage, you can cause flames to wreathe you until the end of your next turn. The flames don’t harm you or your possessions, and they shed bright light out to 30 feet and dim light for an additional 30 feet. While the flames are present, any creature within 5 feet of you that hits you with a melee attack takes 1d4 fire damage.</li></ul></p>"
  },
  {
    "f_id": 23,
    "f_name": "Grappler",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Strength 13 or higher",
    "f_description": "<p>You’ve developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:<ul><li>You have advantage on attack rolls against a creature you are grappling.</li><li>You can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both restrained until the grapple ends.</li><li>Creatures that are one size larger than you don’t automatically succeed on checks to escape your grapple.</li></ul></p>"
  },
  {
    "f_id": 24,
    "f_name": "Great Weapon Master",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You’ve learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:<ul><li>On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.</li><li>Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a - 5 penalty to the attack roll. If the attack hits, you add +10 to the attack’s damage.</li></ul></p>"
  },
  {
    "f_id": 25,
    "f_name": "Grudge-Bearer",
    "f_prerequisite_race": "Dwarf",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have a deep hatred for a particular kind of creature. Choose your foes, a type of creature to bear the burden of your wrath: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can choose two races of humanoid (such as gnolls and orcs). You gain the following benefits:<ul><li>Increase your Strength, Constitution, or Wisdom score by 1, to a maximum of 20.</li><li>During the first round of any combat against your chosen foes, your attack rolls against any of them have advantage.</li><li>When any of your chosen foes makes an opportunity attack against you, it makes the attack roll with disadvantage.</li><li>Whenever you make an Intelligence (Arcana, History, Nature, or Religion) check to recall information about your chosen foes, you add double your proficiency bonus to the check, even if you’re not normally proficient.</li></ul></p>"
  },
  {
    "f_id": 26,
    "f_name": "Healer",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:<ul><li>When you use a healer’s kit to stabilize a dying creature, that creature also regains 1 hit point.</li><li>As an action, you can spend one use of a healer’s kit to tend to a creature and restore 1d6 + 4 hit points to it, plus additional hit points equal to the creature’s maximum number of Hit Dice. The creature can’t regain hit points from this feat again until it finishes a short or long rest.</li></ul></p>"
  },
  {
    "f_id": 27,
    "f_name": "Heavily Armored",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Proficiency with medium armor",
    "f_description": "<p>You have trained to master the use of heavy armor, gaining the following benefits:<ul><li>Increase your Strength score by 1, to a maximum of 20.</li><li>You gain proficiency with heavy armor.</li></ul></p>"
  },
  {
    "f_id": 28,
    "f_name": "Heavy Armor Master",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Proficiency with heavy armor",
    "f_description": "<p>You can use your armor to deflect strikes that would kill others. You gain the following benefits:<ul><li>Increase your Strength score by 1, to a maximum of 20.</li><li>While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from non magical weapons is reduced by 3.</li></ul></p>"
  },
  {
    "f_id": 29,
    "f_name": "Human Determination",
    "f_prerequisite_race": "Human",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You are filled with a determination that can draw the unreachable within your reach. You gain the following benefits:<ul><li>Increase one ability score of your choice by 1, to a maximum of 20.</li><li>When you make an attack roll, an ability check, or a saving throw, you can do so with advantage. Once you use this ability, you can’t use it again until you finish a short or long rest.</li></ul></p>"
  },
  {
    "f_id": 30,
    "f_name": "Infernal Constitution",
    "f_prerequisite_race": "Tiefling",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Fiendish blood runs strong in you, unlocking a resilience akin to that possessed by some fiends. You gain the following benefits:<ul><li>Increase your Constitution score by 1, to a maximum of 20.</li><li>You have resistance to cold damage and poison damage.</li><li>You have advantage on saving throws against being poisoned.</li></ul></p>"
  },
  {
    "f_id": 31,
    "f_name": "Inspiring Leader",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Charisma 13 or higher",
    "f_description": "<p>You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can’t gain temporary hit points from this feat again until it has finished a short or long rest.</p>"
  },
  {
    "f_id": 32,
    "f_name": "Keen Mind",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits:<ul><li>Increase your Intelligence score by 1, to a maximum of 20.</li><li>You always know which way is north.</li><li>You always know the number of hours left before the next sunrise or sunset.</li><li>You can accurately recall anything you have seen or heard within the past month.</li></ul></p>"
  },
  {
    "f_id": 33,
    "f_name": "Lightly Armored",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have trained to master the use of light armor, gaining the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>You gain proficiency with light armor.</li></ul></p>"
  },
  {
    "f_id": 34,
    "f_name": "Linguist",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have studied languages and codes, gaining the following benefits:<ul><li>Increase your Intelligence score by 1, to a maximum of 20.</li><li>You learn three languages of your choice.</li><li>You can ably create written ciphers. Others can’t decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it.</li></ul></p>"
  },
  {
    "f_id": 35,
    "f_name": "Lucky",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have inexplicable luck that seems to kick in at just the right moment. You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw. You can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker’s roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled. You regain your expended luck points when you finish a long rest.</p>"
  },
  {
    "f_id": 36,
    "f_name": "Mage Slayer",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:<ul><li>When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.</li><li>When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.</li><li>You have advantage on saving throws against spells cast by creatures within 5 feet of you.</li></ul></p>"
  },
  {
    "f_id": 37,
    "f_name": "Magic Initiate",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class’s spell list. In addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again. Your spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid: or Intelligence for wizard.</p>"
  },
  {
    "f_id": 38,
    "f_name": "Martial Adept",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:<ul><li>You learn two maneuvers of your choice from among those available to the Battle Master archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver’s effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).</li><li>If you already have superiority dice, you gain one more; otherwise, you have one superiority die, which is a d6. This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.</li></ul></p>"
  },
  {
    "f_id": 39,
    "f_name": "Medium Armor Master",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Proficiency with medium armor",
    "f_description": "<p>You have practiced moving in medium armor to gain the following benefits:<ul><li>Wearing medium armor doesn’t impose disadvantage on your Dexterity (Stealth) checks.</li><li>When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher.</li></ul></p>"
  },
  {
    "f_id": 40,
    "f_name": "Mobile",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You are exceptionally speedy and agile. You gain the following benefits:<ul><li>Your speed increases by 10 feet.</li><li>When you use the Dash action, difficult terrain doesn’t cost you extra movement on that turn.</li><li>When you make a melee attack against a creature, you don’t provoke opportunity attacks from that creature for the rest o f the turn, whether you hit or not.</li></ul></p>"
  },
  {
    "f_id": 41,
    "f_name": "Moderately Armored",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Proficiency with light armor",
    "f_description": "<p>You have trained to master the use of medium armor and shields, gaining the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>You gain proficiency with medium armor and shields.</li></ul></p>"
  },
  {
    "f_id": 42,
    "f_name": "Mounted Combatant",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You are a dangerous foe to face while mounted. While you are mounted and aren’t incapacitated, you gain the following benefits:<ul><li>You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.</li><li>You can force an attack targeted at your mount to target you instead.</li><li>If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.</li></ul></p>"
  },
  {
    "f_id": 43,
    "f_name": "Observant",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Quick to notice details of your environment, you gain the following benefits:<ul><li>Increase your Intelligence or Wisdom score by 1, to a maximum of 20.</li><li>If you can see a creature’s mouth while it is speaking a language you understand, you can interpret what it’s saying by reading its lips.</li><li>You have a +5 bonus to your passive Wisdom (Perception) and passive Intelligence (Investigation) scores.</li></ul></p>"
  },
  {
    "f_id": 44,
    "f_name": "Orcish Aggression",
    "f_prerequisite_race": "Half Orc",
    "f_prerequisite_skill": "None",
    "f_description": "<p>As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started.</p>"
  },
  {
    "f_id": 45,
    "f_name": "Orcish Fury",
    "f_prerequisite_race": "Half Orc",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your fury burns tirelessly. You gain the following benefits:<ul><li>Increase your Strength or Constitution score by 1, up to a maximum of 20.</li><li>When you hit with an attack made with a simple or martial weapon, you can roll one of the weapon’s damage dice an additional time and add it as extra damage of the weapon’s damage type. Once you use this ability, you can’t use it again until you finish a short or long rest.</li><li>Immediately after you use your Relentless Endurance trait, you can use your reaction to make one weapon attack.</li></ul></p>"
  },
  {
    "f_id": 46,
    "f_name": "Polearm Master",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You can keep your enemies at bay with reach weapons. You gain the following benefits:<ul><li>When you take the Attack action and attack with only a glaive, halberd, or quarterstaff, you can use a bonus action to make a melee attack with the opposite end of the weapon. The weapon’s damage die for this attack is a d4, and the attack deals bludgeoning damage.</li><li>While you are wielding a glaive, halberd, pike, or quarterstaff, other creatures provoke an opportunity attack from you when they enter your reach.</li></ul></p>"
  },
  {
    "f_id": 47,
    "f_name": "Prodigy",
    "f_prerequisite_race": [
      "Human",
      "Half Elf",
      "Half Orc"
    ],
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have a knack for learning new things. You gain the following benefits:<ul><li>You gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.</li><li>Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn’t already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.</li></ul></p>"
  },
  {
    "f_id": 48,
    "f_name": "Resilient",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Choose one ability score. You gain the following benefits:<ul><li>Increase the chosen ability score by 1, to a maximum of 20.</li><li>You gain proficiency in saving throws using the chosen ability.</li></ul></p>"
  },
  {
    "f_id": 49,
    "f_name": "Ritual Caster",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Intelligence or Wisdom 13 or higher",
    "f_description": "<p>You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them. When you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: bard, cleric, druid, sorcerer, warlock, or wizard. You must choose your spells from that class’s spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard. If you come across a spell in written form, such as a magical spell scroll or a wizard’s spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell’s level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it.</p>"
  },
  {
    "f_id": 50,
    "f_name": "Savage Attacker",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon’s damage dice and use either total.</p>"
  },
  {
    "f_id": 51,
    "f_name": "Second Chance",
    "f_prerequisite_race": "Halfling",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Fortune favors you when someone tries to strike you. You gain the following benefits:<ul><li>Increase your Dexterity, Constitution or Charisma score by 1, to a maximum of 20.</li><li>When a creature you can see hits you with an attack roll, you can use your reaction to force that creature to reroll. Once you use this ability, you can’t use it again until you roll initiative at the start of combat or until you finish a short or long rest.</li></ul></p>"
  },
  {
    "f_id": 52,
    "f_name": "Sentinel",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have mastered techniques to take advantage of every drop in any enemy’s guard, gaining the following benefits:<ul><li>When you hit a creature with an opportunity attack, the creature’s speed becomes 0 for the rest of the turn.</li><li>Creatures within 5 feet of you provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.</li><li>When a creature within 5 feet of you makes an attack against a target other than you (and that target doesn’t have this feat), you can use your reaction to make a melee weapon attack against the attacking creature.</li></ul></p>"
  },
  {
    "f_id": 53,
    "f_name": "Sharpshooter",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:<ul><li>Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.</li><li>Your ranged weapon attacks ignore half cover and three-quarters cover.</li><li>Before you make an attack with a ranged weapon that you are proficient with, you can choose to take a - 5 penalty to the attack roll. If the attack hits, you add +10 to the attack’s damage.</li></ul></p>"
  },
  {
    "f_id": 54,
    "f_name": "Shield Master",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a shield:<ul><li>If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.</li><li>If you aren’t incapacitated, you can add your shield’s AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.</li><li>If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect.</li></ul></p>"
  },
  {
    "f_id": 55,
    "f_name": "Skilled",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You gain proficiency in any combination of three skills or tools of your choice.</p>"
  },
  {
    "f_id": 56,
    "f_name": "Skulker",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Dexterity 13 or higher",
    "f_description": "<p>You are expert at slinking through shadows. You gain the following benefits:<ul><li>You can try to hide when you are lightly obscured from the creature from which you are hiding.</li><li>When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.</li><li>Dim light doesn’t impose disadvantage on your Wisdom (Perception) checks relying on sight.</li></ul></p>"
  },
  {
    "f_id": 57,
    "f_name": "Spell Sniper",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "The ability to cast at least one spell",
    "f_description": "<p>You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:<ul><li>When you cast a spell that requires you to make an attack roll, the spell’s range is doubled.</li><li>Your ranged spell attacks ignore half cover and three-quarters cover.</li><li>You learn one cantrip that requires an attack roll.</li></ul>Choose the cantrip from the bard, cleric, druid, sorcerer, warlock, or wizard spell list. Your spellcasting ability for this cantrip depends on the spell list you chose from: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.</p>"
  },
  {
    "f_id": 58,
    "f_name": "Squat Nimbleness",
    "f_prerequisite_race": [
      "Dwarf",
      "Gnome",
      "Halfling",
      "Goblin",
      "Kobold"
    ],
    "f_prerequisite_skill": "None",
    "f_description": "<p>You are uncommonly nimble for your race. You gain the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>Increase your walking speed by 5 feet.</li><li>You gain proficiency in the Acrobatics or Athletics skill (your choice).</li><li>You have advantage on any Strength (Athletics) or Dexterity (Acrobatics) check you make to escape from being grappled.</li></ul></p>"
  },
  {
    "f_id": 59,
    "f_name": "Tavern Brawler",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:<ul><li>Increase your Strength or Constitution score by 1, to a maximum of 20.</li><li>You are proficient with improvised weapons and unarmed strikes.</li><li>Your unarmed strike uses a d4 for damage.</li><li>When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target.</li></ul></p>"
  },
  {
    "f_id": 60,
    "f_name": "Tough",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points.</p>"
  },
  {
    "f_id": 61,
    "f_name": "War Caster",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "The ability to cast at least one spell",
    "f_description": "<p>You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:<ul><li>You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.</li><li>You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.</li><li>When a hostile creature’s movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature.</li></ul></p>"
  },
  {
    "f_id": 62,
    "f_name": "Weapon Master",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have practiced extensively with a variety of weapons, gaining the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>You gain proficiency with four weapons of your choice.</li></ul></p>"
  },
  {
    "f_id": 63,
    "f_name": "Wonder Maker",
    "f_prerequisite_race": "Rock Gnome",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You master the tinker techniques of your people. You gain the following benefits:<ul><li>Increase your Dexterity or Intelligence score by 1, to a maximum of 20.</li><li>When you make a check using your proficiency with tinker’s tools, you add double your proficiency bonus to the check.</li><li>When you make a device with your Tinker trait, you have the following additional options for what you make:<ul><li>Alarm. This device senses when a creature moves to within 15 feet of it without speaking aloud a password chosen when you create it. One round after a creature moves into range, the alarm makes a shrill ringing that lasts for 1 minute and can be heard from up to 300 feet away.</li><li>Calculator. This device makes doing sums easy.</li><li>Lifter. This device can be used as a block and tackle, allowing its user to hoist five times the weight the user can normally lift.</li><li>Timekeeper. This pocket watch keeps accurate time.</li><li>Weather Sensor. When used as an action, this device predicts weather conditions in a 1-mile radius over the next 4 hours, showing one symbol (clouds, sun/moon, rain, or snow) for each hour.</li></ul></li></ul></p>"
  },
  {
    "f_id": 64,
    "f_name": "Wood Elf Magic",
    "f_prerequisite_race": "Wood Elf",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You learn the magic of the primeval woods, which are revered and protected by your people. You learn one druid cantrip of your choice. You also learn the long strider and pass without trace spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells.</p>"
  },
  {
    "f_id": 65,
    "f_name": "Svirfneblin Magic",
    "f_prerequisite_race": "Deep Gnome",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have inherited the innate spellcasting ability of your ancestors. This ability allows you to cast nondetection on yourself at will, without needing a material component. You can also cast each of the following spells once with this ability: blindness/deafness, blur, and disguise self. You regain the ability to cast these spells when you finish a long rest. Intelligence is your spellcasting ability for these spells.</p>"
  },
  {
    "f_id": 66,
    "f_name": "Artificer Initiate",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You’ve learned some of an artificer’s inventiveness:</p><p><ul><li>You learn one cantrip of your choice from the artificer spell list, and you learn one 1st-level spell of your choice from that list. Intelligence is your spellcasting ability for these spells.</li><li>You can cast this feat’s 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.</li><li>You gain proficiency with one type of artisan’s tools of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability.</li></ul></p>"
  },
  {
    "f_id": 67,
    "f_name": "Chef",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Time spent mastering the culinary arts has paid off, granting you the following benefits:</p><p><ul><li>Increase your Constitution or Wisdom score by 1, to a maximum of 20.</li><li>You gain proficiency with cook’s utensils if you don’t already have it.</li><li>As part of a short rest, you can cook special food, provided you have ingredients and cook’s utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra 1d8 hit points.</li><li>With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to your proficiency bonus.</li></ul></p>"
  },
  {
    "f_id": 68,
    "f_name": "Crusher",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You are practiced in the art of crushing your enemies, granting you the following benefits:</p><p><ul><li>Increase your Strength or Constitution by 1, to a maximum of 20.</li><li>Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.</li><li>When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the start of your next turn.</li></ul></p>"
  },
  {
    "f_id": 69,
    "f_name": "Eldritch Adept",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Spellcasting or Pact Magic feature",
    "f_description": "<p>Studying occult lore, you have unlocked eldritch power within yourself: you learn one Eldritch Invocation option of your choice from the warlock class. If the invocation has a prerequisite of any kind, you can choose that invocation only if you’re a warlock who meets the prerequisite.</p><p>Whenever you gain a level, you can replace the invocation with another one from the warlock class."
  },
  {
    "f_id": 70,
    "f_name": "Fey Touched",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your exposure to the Feywild’s magic has changed you, granting you the following benefits:</p><p><ul><li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li><li>You learn the misty step spell and one 1st-level spell of your choice. The 1st-level spell must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can’t cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells’ spellcasting ability is the ability increased by this feat.</li></ul></p>"
  },
  {
    "f_id": 71,
    "f_name": "Fighting Initiate",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Proficiency with a martial weapon",
    "f_description": "<p>Your martial training has helped you develop a particular style of fighting. As a result, you learn one Fighting Style option of your choice from the fighter class. If you already have a style, the one you choose must be different.</p><p>Whenever you reach a level that grants the Ability Score Improvement feature, you can replace this feat’s fighting style with another one from the fighter class that you don’t have."
  },
  {
    "f_id": 72,
    "f_name": "Gunner",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have a quick hand and keen eye when employing firearms, granting you the following benefits:</p><p><ul><li>Increase your Dexterity score by 1, to a maximum of 20.</li><li>You gain proficiency with firearms (see “Firearms” in the Dungeon Master’s Guide).</li><li>You ignore the loading property of firearms.</li><li>Being within 5 feet of a hostile creature doesn’t impose disadvantage on your ranged attack rolls.</li></ul></p>"
  },
  {
    "f_id": 73,
    "f_name": "Metamagic Adept",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "Spellcasting or Pact Magic feature",
    "f_description": "<p>You’ve learned how to exert your will on your spells to alter how they function:</p><p><ul><li>You learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you reach a level that grants the Ability Score Improvement feature, you can replace one of these Metamagic options with another one from the sorcerer class.</li><li>You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest.</li></ul></p>"
  },
  {
    "f_id": 74,
    "f_name": "Piercer",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have achieved a penetrating precision in combat, granting you the following benefits:</p><p><ul><li>Increase your Strength or Dexterity by 1, to a maximum of 20.</li><li>Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack’s damage dice, and you must use the new roll.</li><li>When you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes.</li></ul></p>"
  },
  {
    "f_id": 75,
    "f_name": "Poisoner",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You can prepare and deliver deadly poisons, granting you the following benefits:</p><p><ul><li>When you make a damage roll that deals poison damage, it ignores resistance to poison damage.</li><li>You can apply poison to a weapon or piece of ammunition as a bonus action, instead of an action.</li><li>You gain proficiency with the poisoner’s kit if you don’t already have it. With one hour of work using a poisoner’s kit and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution saving throw or take 2d8 poison damage and become poisoned until the end of your next turn.</li></ul></p>"
  },
  {
    "f_id": 76,
    "f_name": "Shadow Touched",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>Your exposure to the Shadowfell’s magic has changed you, granting you the following benefits:</p><p><ul><li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li><li>You learn the invisibility spell and one 1st-level spell of your choice. The 1st-level spell must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can’t cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells’ spellcasting ability is the ability increased by this feat.</li></ul></p>"
  },
  {
    "f_id": 77,
    "f_name": "Skill Expert",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You have honed your proficiency with particular skills, granting you the following benefits:</p><p><ul><li>Increase one ability score of your choice by 1, to a maximum of 20.</li><li>You gain proficiency in one skill of your choice.</li><li>Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn’t already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.</li></ul></p>"
  },
  {
    "f_id": 78,
    "f_name": "Slasher",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You’ve learned where to cut to have the greatest results, granting you the following benefits:</p><p><ul><li>Increase your Strength or Dexterity by 1, to a maximum of 20.</li><li>Once per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.</li><li>When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls.</li></ul></p>"
  },
  {
    "f_id": 79,
    "f_name": "Telekinetic",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You learn to move things with your mind, granting you the following benefits:</p><p><ul><li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li><li>You learn the mage hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.</li><li>As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save.</li></ul></p>"
  },
  {
    "f_id": 80,
    "f_name": "Telepathic",
    "f_prerequisite_race": "None",
    "f_prerequisite_skill": "None",
    "f_description": "<p>You awaken the ability to mentally connect with others, granting you the following benefits:</p><p><ul><li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li><li>You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn’t give the creature the ability to respond to you telepathically.</li><li>You can cast the detect thoughts spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. Your spellcasting ability for the spell is the ability increased by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them.</li></ul></p>"
  }
]
