[
  {
    "s_id": 0,
    "s_lvl": "Cantrip",
    "s_class_usage": [
      "Wizard",
      "Sorcerer"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "60 feet",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_school": "Conjuration",
    "s_ritual": false,
    "s_name": "Acid Splash",
    "s_description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or lake 1d6 acid damage. This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th leveI (3d6), and 17th level (4d6)."
  },
  {
    "s_id": 1,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Paladin",
      "Cleric"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a tiny strip of white cloth)",
    "s_duration": "8 hours",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Aid",
    "s_description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration. At Higher LeveIs. When you cast this spell using a spell slot of 3rd leveI or higher, a target's hit points increase by an additional 5 for each slot level above 2nd."
  },
  {
    "s_id": 2,
    "s_lvl": "1st",
    "s_class_usage": [
      "Ranger",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a tiny bell and a piece of fine silver wire)",
    "s_duration": "8 hours",
    "s_school": "Abjuration",
    "s_ritual": true,
    "s_name": "Alarm",
    "s_description": "You set an alarm against unwanted intrusion. Choose a door. a window, or an area wilhin range that is no larger lhan a 20-foot cube. Until lhe spell ends. an alarm alerts you whenever a Tiny or larger creature touches or enters lhe warded area. When you cast the spell, you can designate creatures lhat won't set off the alarm. You also choose whether the alarm is mental or audible. A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. An audible alarm produces the sound of a hand bell for 10 seconds within 60 feel."
  },
  {
    "s_id": 3,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Alter Self",
    "s_description": "You assume a different formo When you cast lhe spell. choose one of the following options, the effects of which last for the duralion of the spell. While lhe spell lasts, you can end one option as an aclion lo gain the benefils of a differenl one. <br><b>Aquatic Adaptation</b>. You adapt your body to an aquatic environment, sprouting gills and growing webbing belween your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed. <br><b>Change Appearance.</b> You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair lenglh, coloration, and distinguishing characteristics, if any, You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a differenl size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duralion of the spell, you can use your action to change your appearance in this way again. <br><b>Natural Weapons.</b> You grow claws, fangs, spines, horns, or a differenl natural weapon of your choice. Your unarmed strikes deal ld6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient wilh your unarmed strikes. Finally, lhe natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it."
  },
  {
    "s_id": 4,
    "s_lvl": "1st",
    "s_class_usage": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a morsel of food)",
    "s_duration": "24 hours",
    "s_school": "Enchantment",
    "s_ritual": false,
    "s_name": "Animal Friendship",
    "s_description": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends. <br><b>At Higher Levels.</b> When you cast this spell using a spell slot of 2nd leveI or higher, you can affect one additional beast for each slot level above 1st."
  },
  {
    "s_id": 5,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a morsel of food)",
    "s_duration": "24 hours",
    "s_school": "Enchantment",
    "s_ritual": true,
    "s_name": "Animal Messenger",
    "s_description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as -a man or woman dressed in the uniform of lhe town guard- or -a red-haired dwarf wearing a pointed hat.- You also speak a message of up twenty-five words. The target beast travels for the duralion of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals. When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell. <br><b>At Higher LeveIs.</b> If you cast this spell using a spell slot of 2nd level or higher, the duration of the spell increases by 48 hours for each slol level above 2nd."
  },
  {
    "s_id": 6,
    "s_lvl": "8th",
    "s_class_usage": [
      "Druid"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 24 hours",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Animal Shapes",
    "s_description": "Your magic turns others into beasts. Choose any number of willing creatures that you can see within range. You transform each target into the form of a Large or smaller beast with a challenge rating of 4 or lower. On subsequent turns, you can use your action to transform affected creatures into new forms. The transformation lasts for the duration for each target, or until the target drops to O hit points or dies. You can choose a different form for each target. A target's game statistics are replaced by the statistics of the chosen beast, though the target retains its alignment and Intelligence, Wisdom, and Charisma scores. The target assumes the hit points of its new form, and when it reverts to its normal form, it returns to the number of hit points it had before ir rransformed. If it reverts as a result of dropping to O hit poinls, any excess damage carries over to its normal form long as the excess damage doesn't reduce the creature's normal form to O hit poinlt, it isn't knocked unconscious. The creature is limiled in the actions it can perform by the nature of its new form, and it can't speak or cast spells. <br>The target's gear melds into the new form. The target can't activate, wield, or otherwise benefit from any of its equipment."
  }
]
