[
  {
    "s_id": 0,
    "s_lvl": "Cantrip",
    "s_class_usage": [
      "Wizard",
      "Sorcerer"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "60 feet",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_school": "Conjuration",
    "s_ritual": false,
    "s_name": "Acid Splash",
    "s_description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or lake 1d6 acid damage. This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th leveI (3d6), and 17th level (4d6)."
  },
  {
    "s_id": 4,
    "s_lvl": "1st",
    "s_class_usage": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a morsel of food)",
    "s_duration": "24 hours",
    "s_school": "Enchantment",
    "s_ritual": false,
    "s_name": "Animal Friendship",
    "s_description": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends. <br><b>At Higher Levels.</b> When you cast this spell using a spell slot of 2nd leveI or higher, you can affect one additional beast for each slot level above 1st."
  },
  {
    "s_id": 1,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Paladin",
      "Cleric"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a tiny strip of white cloth)",
    "s_duration": "8 hours",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Aid",
    "s_description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration. At Higher LeveIs. When you cast this spell using a spell slot of 3rd leveI or higher, a target's hit points increase by an additional 5 for each slot level above 2nd."
  },
  {
    "s_id": 7,
    "s_lvl": "3rd",
    "s_class_usage": [
      "Cleric",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 minute",
    "s_range": "10 feet",
    "s_components": "V, S, M (a drop of blood, a piece of flesh and a pinch of bone dust)",
    "s_duration": "Instantaneous",
    "s_school": "Necromancy",
    "s_ritual": false,
    "s_name": "Animate Dead",
    "s_description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature's game statistics).<br> On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.<br> The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one.<br> <b>At Higher Levels.</b> When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones."
  },
  {
    "s_id": 8,
    "s_lvl": "5th",
    "s_class_usage": [
      "Bard",
      "Sorcerer"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "120 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Animate Objects",
    "s_description": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points.<br> As a bonus action, you can mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.<br> An animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion, it instead has a f1yingspeed of 30 feet and can hover. If the object is securely attached to a surface or a larger object, such as a chain bolted to a wall, its speed is O. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it reverts to its original object form, and any remaining damage carries over to its original object form.<br> If you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determined by its size. The DM might rule that a specific object inflicts slashing or piercing damage based on its form. <br> <b>At Higher Levels.</b> If you cast this spell using a spell slot of 6th level or higher, you can animate two additional objects for each slot level above 5th."
  },
  {
    "s_id": 2,
    "s_lvl": "1st",
    "s_class_usage": [
      "Ranger",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a tiny bell and a piece of fine silver wire)",
    "s_duration": "8 hours",
    "s_school": "Abjuration",
    "s_ritual": true,
    "s_name": "Alarm",
    "s_description": "You set an alarm against unwanted intrusion. Choose a door. a window, or an area wilhin range that is no larger lhan a 20-foot cube. Until lhe spell ends. an alarm alerts you whenever a Tiny or larger creature touches or enters lhe warded area. When you cast the spell, you can designate creatures lhat won't set off the alarm. You also choose whether the alarm is mental or audible. A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. An audible alarm produces the sound of a hand bell for 10 seconds within 60 feel."
  },
  {
    "s_id": 3,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Alter Self",
    "s_description": "You assume a different formo When you cast lhe spell. choose one of the following options, the effects of which last for the duralion of the spell. While lhe spell lasts, you can end one option as an aclion lo gain the benefils of a differenl one. <br><b>Aquatic Adaptation</b>. You adapt your body to an aquatic environment, sprouting gills and growing webbing belween your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed. <br><b>Change Appearance.</b> You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair lenglh, coloration, and distinguishing characteristics, if any, You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a differenl size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duralion of the spell, you can use your action to change your appearance in this way again. <br><b>Natural Weapons.</b> You grow claws, fangs, spines, horns, or a differenl natural weapon of your choice. Your unarmed strikes deal ld6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient wilh your unarmed strikes. Finally, lhe natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it."
  },
  {
    "s_id": 5,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a morsel of food)",
    "s_duration": "24 hours",
    "s_school": "Enchantment",
    "s_ritual": true,
    "s_name": "Animal Messenger",
    "s_description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as -a man or woman dressed in the uniform of lhe town guard- or -a red-haired dwarf wearing a pointed hat.- You also speak a message of up twenty-five words. The target beast travels for the duralion of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals. When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell. <br><b>At Higher LeveIs.</b> If you cast this spell using a spell slot of 2nd level or higher, the duration of the spell increases by 48 hours for each slol level above 2nd."
  },
  {
    "s_id": 6,
    "s_lvl": "8th",
    "s_class_usage": [
      "Druid"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 24 hours",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Animal Shapes",
    "s_description": "Your magic turns others into beasts. Choose any number of willing creatures that you can see within range. You transform each target into the form of a Large or smaller beast with a challenge rating of 4 or lower. On subsequent turns, you can use your action to transform affected creatures into new forms. The transformation lasts for the duration for each target, or until the target drops to 0 hit points or dies. You can choose a different form for each target. A target's game statistics are replaced by the statistics of the chosen beast, though the target retains its alignment and Intelligence, Wisdom, and Charisma scores. The target assumes the hit points of its new form, and when it reverts to its normal form, it returns to the number of hit points it had before ir rransformed. If it reverts as a result of dropping to 0 hit poinls, any excess damage carries over to its normal form long as the excess damage doesn't reduce the creature's normal form to 0 hit poinlt, it isn't knocked unconscious. The creature is limiled in the actions it can perform by the nature of its new form, and it can't speak or cast spells. <br>The target's gear melds into the new form. The target can't activate, wield, or otherwise benefit from any of its equipment."
  },
  {
    "s_id": 7,
    "s_lvl": "8th",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "150 feet",
    "s_components": "V, S, M (a bit of sponge)",
    "s_duration": "Instantaneous",
    "s_school": "Necromancy",
    "s_ritual": false,
    "s_name": "Abi-Dalzim’s Horrid Wilting",
    "s_description": "You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren’t affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one.</br>Nonmagical plants in the area that aren’t creatures, such as trees and shrubs, wither and die instantly."
  },
  {
    "s_id": 8,
    "s_lvl": "1st",
    "s_class_usage": [
      "Druid",
      "Ranger",
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Support",
    "s_cast_time": "Reaction",
    "s_range": "Self",
    "s_components": "S",
    "s_duration": "1 round",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Absorb Elements",
    "s_description": "1 Reaction, which you take when you take acid, cold, fire, lightning, or thunder damage</br>The spell captures some of the incoming energy, lessening its effect on you and storing it for your next melee attack. You have resistance to the triggering damage type until the start of your next turn. Also, the first time you hit with a melee attack on your next turn, the target takes an extra 1d6 damage of the triggering type, and the spell ends.</br><b>At higher level</b></br>When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st."
  },
  {
    "s_id": 9,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a red dragon’s scale)",
    "s_duration": "Instantaneous",
    "s_school": "Evocation",
    "s_ritual": false,
    "s_name": "Aganazzar's Scorcher",
    "s_description": "A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. </br>Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.<br><b>At higher level</b></br>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
  },
  {
    "s_id": 10,
    "s_lvl": "5th",
    "s_class_usage": [
      "Druid"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Self (10-foot radius)",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Antilife Shell",
    "s_description": "A shimmering barrier extends out from you in a 10-foot radius and moves with you, remaining centered on you and hedging out creatures other than undead and constructs. </br>The barrier lasts for the duration. The barrier prevents an affected creature from passing or reaching through. An affected creature can cast spells or make attacks with ranged or reach weapons through the barrier. </br>If you move so that an affect creature is forced to pass through the barrier, the spell ends."
  },
  {
    "s_id": 11,
    "s_lvl": "8th",
    "s_class_usage": [
      "Cleric",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Self (10-foot-radius sphere)",
    "s_components": "V, S M (a pinch of powdered iron or iron filings)",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Antimagic Field",
    "s_description": "A 10-foot-radius invisible sphere of antimagic surrounds you. <br/>This area is divorced from the magical energy that suffeses the multiverse. Within the sphere, spells can’t be cast, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the spere moves with you, centered on you. Spells and other magical effects, except those created by an artifact or a deity, are suppressed in the sphere and can’t protrude into it. A slot expended to cast a suppressed spell is consumed. While an effect is suppressed, it doesn’t function, but the time it spends suppressed counts against its duration. </br><b>Targeted Effects. </b><br>Spells and other magical effects, such as magic missle and charm person, that target a creature or an object in the sphere have no effect on that target. <br><b>Areas of Magic. </b><br>The area of another spell or magical effect, such as fireball, can’t extend into the sphere. If the sphere overlaps an area of magic, the part of the area that is covered by the sphere is suppressed. For example, the flames created by a wall of fire are suppressed within the sphere, creating a gap in the wall if the overlap is large enough. <br><b>Spells. </b><br>Any active spell or other magical effect on a creature or an object in the sphere is suppressed while the creature or object is in it. <br><b>Magic Items. </b><br>The properties and powers of magic items are suppressed in the sphere. Forexample, a +1 longsword in the sphere functions as a nonmagical longsword. A magic weapon’s properties and powers are suppressed if it is used against a target in the sphere or wielded by an attacker in the sphere. If a magic weapon or piece of magic ammunition fully leaves the sphere (For example, if you fire a magic arrow or throw a magic spear at a target outside the sphere), the magic of the item ceases to be supressed as soon as it exits. <br><b>Magical Travel. </b><br>Teleportation and planar travel fail to work in the sphere, whether the sphere is the destination or the departure point for such magical travel. A portal to another location, world, or plane of existence, as well as an opening to an extradimensional space such as that created by the rope trick spells, temporarily closes while in the sphere. <br><b>Creatures and Objects. </b><br>A creature or object summoned or created by magic temporarily winks out of existence in the sphere. Such a creature instantly reappears once the space the creature occupied is no longer withinthe sphere. <br><b>Dispel Magic. </b><br>Spells and magical effects such as dispel magic have no effect on the sphere. Likewise, the spheres created by different antimagic field spells don’t nullify each other."
  },
  {
    "s_id": 12,
    "s_lvl": "8th",
    "s_class_usage": [
      "Druid",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 hour",
    "s_range": "60 feet",
    "s_components": "V, S, M (either a lump of alum soaked in vinegar for the antipathy effect or a drop of honey for the sympathy effect)",
    "s_duration": "10 days",
    "s_school": "Enchantment",
    "s_ritual": false,
    "s_name": "Antipathy/Sympathy",
    "s_description": "This spell attracts or repels creatures of your choice. <br>You target something within range, either a Huge or smaller object or creature or an area that is no larger than a 200-foot cube. Then specify a kind of intelligent creature, such as red dragons, goblins, or vampires. You invest the target with an aura that either attracts or repels the specified creatures for the duration. Choose antipathy or sympathy as the aura’s effect. <br><b>Antipathy. </b><br>The enchantment causes creatures of the kind you designated to feel an intense urge to leave the area and avoid the target. When such a creature can see the target or comes within 60 feet of it, the creature must succeed on a Wisdom saving throw or become frightened. The creature remains frightened while it can see the target or is within 60 feet of it. While frightened by the target, the creature must use its movement to move to the nearest safe spot from which it can’t see the target. If the creature moves more than 60 feet from the target and can’t see it, the creature is no longer frightened, but the creature becomes frightened again if it regains sight of the target or moves within 60 feet of it. <br><b>Sympathy. </b><br>The enchantment causes the specified creatures to feel an intense urge to approach the target while within 60 feet of it or able to see it. When such a creature can see the target or comes within 60 feet o fit, the creature must succeed on a Wisdom saving throw or use its movement on each of its turns to enter the area or move within reach of the target. When the creature has done so, it can’t willingly move away from the target. If the target damages or otherwise harms an affected creature, the affected creature can make a Wisdom saving throw to end the effect, as described below. <br><b>Ending the Effect. </b><br>If an affected creature ends its turn while not within 60 feet of the target or able to see it, the creature makes a Wisdom saving throw. On a successful save, the creature is no longer affected by the target and recognizes the feeling of repugnance or attraction as magical. In addition, a creature affected by the spell is allowed another Wisdom saving throw every 24 hours while the spell persists. <br>A creature that successfully saves against this effect is immune to it for 1 minute, after which time it can be affected again."
  },
  {
    "s_id": 13,
    "s_lvl": "4th",
    "s_class_usage": [
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a bit of bat fur)",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Divination",
    "s_ritual": false,
    "s_name": "Arcane Eye",
    "s_description": "You create an invisible, magical eye within range that hovers in the air for the duration. <br><br>You mentally receive visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction. <br>As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can’t enter another plane of existence. A solid barrier blocks the eye’s movement, but the eye can pass through an opening as small as 1 inch in diameter."
  },
  {
    "s_id": 14,
    "s_lvl": "6th",
    "s_class_usage": [
      "Wizard",
      "Sorcerer",
      "Warlock"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "500 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 10 minutes",
    "s_school": "Conjuration",
    "s_ritual": false,
    "s_name": "Arcane Gate",
    "s_description": "You create linked teleportation portals that remain open for the duration. <br><br>Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost. <br>The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal. <br>Any creature or object entering the portal exits from the other portal as if the two were adjacent to each other; passing through a portal from the nonportal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction."
  },
  {
    "s_id": 15,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Touch",
    "s_components": "V, S, M (gold dust worth at least 25 gp, which the spell consumes)",
    "s_duration": "Until dispelled",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Arcane Lock",
    "s_description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. <br><br>You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting knock on the object suppresses arcane lock for 10 minutes. <br><br>While affected by this spell, the object is more difficult to break or force open; the DC to break it or pick any locks on it increases by 10."
  },
  {
    "s_id": 16,
    "s_lvl": "1st",
    "s_class_usage": [
      "Warlock"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V, S, M (a cup of water)",
    "s_duration": "1 hour",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Armor of Agathys",
    "s_description": "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. <br><br>You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage. <br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot"
  },
  {
    "s_id": 17,
    "s_lvl": "1st",
    "s_class_usage": [
      "Warlock"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "Self (10-foot radius)",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_school": "Conjuration",
    "s_ritual": false,
    "s_name": "Arms of Hadar",
    "s_description": "You invoke the power of Hadar, the Dark Hunger. <br><br>Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can’t take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect. <br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
  },
  {
    "s_id": 18,
    "s_lvl": "9th",
    "s_class_usage": [
      "Warlock",
      "Wizard",
      "Cleric"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 hour",
    "s_range": "10 feet",
    "s_components": "V, S, M (for each creature you affect with this spell, you must provide one jacinth worth at least 1,000 gp and one ornately carved bar of silver worth at least 100 gp, all of which the spell consumes)",
    "s_duration": "Special",
    "s_school": "Necromancy",
    "s_ritual": false,
    "s_name": "Astral Projection",
    "s_description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). <br><br>The material body you leave behind is unconscious and in a state of suspended animation; it doesn’t need food or air and doesn’t age. <br><br>Your astral body resembles your mortal form in almost every way, replicating your game statistics and possessions. The principal difference is the addition of a silvery cord that extends from between your shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to your material body. As long as the tether remains intact, you can find your way home. If the cord is cut something that can happen only when an effect specifically states that it does your soul and body are separated, killing you instantly. <br><br>Your astral form can freely travel through the Astral Plane and can pass through portals there leading to any other plane. If you enter a new plane or return to the plane you were on when casting this spell, your body and possessions are transported along the silver cord, allowing you to re-enter your body as you enter the new plane. Your astral form is a separate incarnation. Any damage or other effects that apply to it have no effect on your physical body, nor do they persist when you return to it. The spell ends for you and your companions when you use your action to dismiss it. When the spell ends, the affected creature returns to its physical body, and it awakens. <br><br>The spell might also end early for you or one of your companions. A successful dispel magic spell used against an astral or physical body ends the spell for that creature. If a creature’s original body or its astral form drops to 0 hit points, the spell ends for that creature. If the spell ends and the silver cord is intact, the cord pulls the creature’s astral form back to its body, ending its state of suspended animation. If you are returned to your body prematurely, your companions remain in their astral forms and must find their own way back to their bodies, usually by dropping to 0 hit points."
  },
  {
    "s_id": 19,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Cleric"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 minute",
    "s_range": "Self",
    "s_components": "V, S, M (specially marked sticks, bones, or similar tokens worth at least 25 gp)",
    "s_duration": "Instantaneous",
    "s_school": "Divination",
    "s_ritual": true,
    "s_name": "Augury",
    "s_description": "By casting gem-inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes. The DM chooses from the following possible omens: <br><br><br>• Weal, for good results <br>• Woe, for bad results <br>• Weal and woe, for both good and bad results <br>• Nothing, for results that aren’t especially good or bad <br><br>The spell doesn’t take into account any possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion. If you cast the spell two or more times before completing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a random reading. The DM makes this roll in secret."
  },
  {
    "s_id": 20,
    "s_lvl": "4th",
    "s_class_usage": [
      "Paladin"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Self (30-foot radius)",
    "s_components": "V",
    "s_duration": "Concentration, up to 10 minutes",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Aura of Life",
    "s_description": "Life-preserving energy radiates from you in an aura with a 30-foot radius. <br>Until the spll ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can’t be reduced. In addition, a nonhostile, living creature regains 1 hit point when it starts its turn in the arua with 0 hit points."
  },
  {
    "s_id": 21,
    "s_lvl": "4th",
    "s_class_usage": [
      "Paladin"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Self (30-foot radius)",
    "s_components": "V",
    "s_duration": "Concentration, up to 10 minutes",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Aura of Purity",
    "s_description": "Purifying energy radiates from you in an aura with a 30-foot radius. <br>Until the spell ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) can’t become diseased, has resistance to poison damage, and has advantage on saving throws against effects that cause any of the following conditions: blnded, charmed, deafended, frightened, paralyzed, poisoned, and stunned."
  },
  {
    "s_id": 22,
    "s_lvl": "3rd",
    "s_class_usage": [
      "Paladin"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Self (30-foot radius)",
    "s_components": "V",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Evocation",
    "s_ritual": false,
    "s_name": "Aura of Vitality",
    "s_description": "Healing energy radiates from you in an aura with a 30-foot radius. <br>Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points."
  },
  {
    "s_id": 23,
    "s_lvl": "5th",
    "s_class_usage": [
      "Bard",
      "Druid"
    ],
    "s_type": "Support",
    "s_cast_time": "8 hours",
    "s_range": "Touch",
    "s_components": "V, S, M (an agate worth at least 1,000 gp, which the spell consumes)",
    "s_duration": "Instantaneous",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Awaken",
    "s_description": "After spending the casting time tracing magical pathways within a precious gemstone, you touch a huge or smaller beast or plant. <br><br>The target must have either no Intelligence score or an Intelligence of 3 or less. The target gains an Intelligence of 10. The target also gains the ability to speak one language you know. If the target is a plant, it gains the ability to move its limbs, roots, vinces, creepers, and so forth, and it gains senses similar to a huamn’s. Your DM chooses statistics appropriate for the awakened plant, such as the statistics for the awakened shrub or the awakened tree. <br><br>The awakened beast or plant is charmed by you for 30 days or until you and your companions do anything harmful to it. When the charmed condition ends, the awakened creature chooses whether to remain friendly to you, based on how you treated it while it was charmed."
  },
  {
    "s_id": 24,
    "s_lvl": "1st",
    "s_class_usage": [
      "Bard",
      "Cleric"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (A drop of blood)",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Enchantment",
    "s_ritual": false,
    "s_name": "Bane",
    "s_description": "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.<br><br><br><b>At higher level</b><br>When you cast this spell using a spelslot of 2nd level or higher, you can target one aditional creature for each slot level above 1st."
  },
  {
    "s_id": 25,
    "s_lvl": "5th",
    "s_class_usage": [
      "Paladin"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 bonus action",
    "s_range": "Self",
    "s_components": "V",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Banishing Smite",
    "s_description": "The next time you hit a creature with a weapon attack before this spell ends, your weapon crackles with force, and the attack deals an extra 5d10 force damage to the target. Additionally, if this attack reduces the target to 50 hit points of fewer, you banish it. If the target is native to a different plane of existence than the on you’re on, the target disappears, returning to its home plane. If the target is native to the plane you’re on, the creature vanishes into a harmless demiplane. While there, the target is incapacitated. It remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied."
  },
  {
    "s_id": 26,
    "s_lvl": "4th",
    "s_class_usage": [
      "Cleric",
      "Paladin",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "60 feet",
    "s_components": "V, S, M (an item distasteful to the target)",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Banishment",
    "s_description": "You attempt to send one creature that you can see within range to another place of existence. The target must succeed on a Charisma saving throw or be banished.<br> <br><br>If the target is native to the plane of existence you’re on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. <br><br>If the target is native to a different plane of existence that the one you’re on, the target is banished with a faint popping noise, returning to its home plane. <br>If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn’t return.<br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th."
  },
  {
    "s_id": 27,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Druid",
      "Ranger"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Touch",
    "s_components": "V, S, M (A handful of oak bark)",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Barkskin",
    "s_description": "You touch a willing creature. Until the spellends, the target’s skin has a rough, bark-like appearance, and the target’s AC can’t be less than 16, regardless of what kind of armor it is wearing."
  },
  {
    "s_id": 28,
    "s_lvl": "3rd",
    "s_class_usage": [
      "Cleric"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Beacon of Hope",
    "s_description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing."
  },
  {
    "s_id": 29,
    "s_lvl": "1st",
    "s_class_usage": [
      "Druid",
      "Ranger"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Touch",
    "s_components": "V, S, M (a bit of fur wrapped in a cloth)",
    "s_duration": "Concentration, up to 10 minutes",
    "s_school": "Divination",
    "s_ritual": false,
    "s_name": "Beast Bond",
    "s_description": "You establish a telepathic link with one beast you touch that is friendly to you or charmed by you. The spell fails if the beast’s Intelligence is 4 or higher. Until the spell ends, the link is active while you and the beast are within line of sight of each other. Through the link, the beast can understand your telepathic messages to it, and it can telepathically communicate simple emotions and concepts back to you. While the link is active, the beast gains advantage on attack rolls against any creature within 5 feet of you that you can see."
  },
  {
    "s_id": 30,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Touch",
    "s_components": "S",
    "s_duration": "Concentration, up to 10 minutes",
    "s_school": "Divination",
    "s_ritual": true,
    "s_name": "Beast Sense",
    "s_description": "You touch a willing beast. For the duration of the spell, you can use your action to see through the beast’s eyes and hear what it hears, and continue to do so until you use your action to return to your normal senses."
  },
  {
    "s_id": 31,
    "s_lvl": "3rd",
    "s_class_usage": [
      "Bard",
      "Cleric",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Touch",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Necromancy",
    "s_ritual": false,
    "s_name": "Bestow Curse",
    "s_description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:<br><br>* Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.<br>* While cursed, the target has disadvantage on attack rolls against you.<br>* While cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.<br>* While the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target. <br><br>A remove curse spell ends this effect. At the DM’s option, you may choose an alternative curse effect, but it should be no more powerful than those described above.<br>The DM has final say on such a curse’s effect.<br><b>At higher level<b/><br>If you cast this spell using a spell slot of 4th level or higher, the duration is concentration, up to 10 minutes. <br>If you use a spell slot of 5th level or higher, the duration is 8 hours. <br>If you use a spell slot of 7th level or higher, the duration is 24 hours. <br>If you use a 9th level spell slot, the spell lasts until it is dispelled. <br>Using a spell slot of 5th level or higher grants a duration that doesn’t require concentration."
  },
  {
    "s_id": 32,
    "s_name": "Bigby’s Hand",
    "s_ritual": false,
    "s_school": "Evocation",
    "s_lvl": "5th",
    "s_cast_time": "1 action",
    "s_range": "120 feet",
    "s_components": "V, S, M (An eggshell and a snakeskin glove)",
    "s_duration": "Concentration, up to 1 minute",
    "s_class_usage": [
      "Wizard"
    ],
    "s_type": "Utility",
    "s_description": "You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spell’s duration, and it moves at your command, mimicking the movements of your own hand. <br><br>The hand is an object that has AC 20 and hit points equal to your hit point maximum. If it drops to 0 hit points, the spell ends. It has a Strength of 26 (+8) and a Dexterity of 10 (+0). The hand doesn’t fill its space. <br><br>When you cast the spell and as a bonus action on your subsequent turns, you can move the hand up to 60 feet and then cause one of the following effects with it.<br><br><b>Clenched Fist </b><br>The hand strikes one creature or object within 5 feet of it. Make a melee spell attack for the hand using your game statistics. On a hit, the target takes 4d8 force damage. <br><br><b>Forceful Hand</b><br>The hand attempts to push a creature within 5 feet of it in a direction you choose. Make a check with the hand’s Strength contested by the Strength (Athletics) check of the target. If the target is Medium or smaller, you have advantage on the check. If you succeed, the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target to remain within 5 feet of it. <br><br><b>Grasping Hand</b><br>The hand attempts to grapple a Huge or smaller creature within 5 feet of it. You use the hand’s Strength score to resolve the grapple. If the target is Medium or smaller, you have advantage on the check. While the hand is grappling the target, you can use a bonus action to have the hand crush it. When you do so, the target takes bludgeoning damage equal to 2d6 + your spellcasting ability modifier. <br><br><b>Interposing Hand</b><br>The hand interposes itself between you and a creature you choose until you give the hand a different command. The hand moves to stay between you and the target, providing you with half cover against the target. The target can’t move through the hand’s space if its Strength score is less than or equal to the hand’s Strength score. If its Strength score is higher than the hand’s Strength score, the target can move toward you through the hand’s space, but that space is difficult terrain for the target.<br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 6th level or higher, the damage from the clenched fist option increases by 2d8 and the damage from the grasping hand increases by 2d6 for each slot level above 5th."
  },
  {
    "s_id": 33,
    "s_name": "Blade Barrier",
    "s_ritual": false,
    "s_school": "Evocation",
    "s_lvl": "6th",
    "s_cast_time": "1 action",
    "s_range": "90 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 10 minutes",
    "s_class_usage": [
      "Cleric"
    ],
    "s_type": "Utility",
    "s_description": "You create a vertical wall of whirling, razor-sharp blades made of magical energy. The wall appears within range and lasts for the duration. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain. <br><br>When a creature enters the wall’s area for the first time on a turn or starts its turn there, the creature must make a Dexterity saving throw. On a failed save, the creature takes 6 d10 slashing damage. On a successful save, the creature takes half as much damage."
  },
  {
    "s_id": 34,
    "s_name": "Blade Ward",
    "s_ritual": false,
    "s_school": "Abjuration",
    "s_lvl": "Cantrip",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V, S",
    "s_duration": "1 round",
    "s_class_usage": [
      "Bard",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "s_type": "Support",
    "s_description": "You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks."
  },
  {
    "s_id": 35,
    "s_name": "Bless",
    "s_ritual": false,
    "s_school": "Enchantment",
    "s_lvl": "1st",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a sprinkling of holy water)",
    "s_duration": "Concentration, up to 1 minute",
    "s_class_usage": [
      "Cleric",
      "Paladin"
    ],
    "s_type": "Support",
    "s_description": "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw. <br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
  },
  {
    "s_id": 36,
    "s_name": "Blight",
    "s_ritual": false,
    "s_school": "Necromancy",
    "s_lvl": "4th",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_class_usage": [
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "s_type": "Damage",
    "s_description": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a Constitution saving throw. The target takes 8d8 necrotic damage on a failed save, or half as much damage on a successful one. This spell has no effect on undead or constructs. <br><br>If you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it. <br><br>If you target a nonmagical plant that isn’t a creature, such as a tree or shrub, it doesn’t make a saving throw; it simply withers and dies.<br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th."
  },
  {
    "s_id": 37,
    "s_name": "Blinding Smite",
    "s_ritual": false,
    "s_school": "Evocation",
    "s_lvl": "3rd",
    "s_cast_time": "1 bonus action",
    "s_range": "Self",
    "s_components": "V",
    "s_duration": "Concentration, up to 1 minute",
    "s_class_usage": [
      "Paladin"
    ],
    "s_type": "Utility",
    "s_description": "The next time you hit a creature with a melee weapon attack during this spell’s duration, you weapon flares with a bright light, and the attack deals an extra 3d8 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends. <br><br>A creature blinded by this spell makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded."
  },
  {
    "s_id": 38,
    "s_name": "Blindness/Deafness",
    "s_ritual": false,
    "s_school": "Necromancy",
    "s_lvl": "2nd",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V",
    "s_duration": "1 minute",
    "s_class_usage": [
      "Bard",
      "Cleric",
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends. <br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
  },
  {
    "s_id": 39,
    "s_name": "Blink",
    "s_ritual": false,
    "s_school": "Transmutation",
    "s_lvl": "3rd",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V, S",
    "s_duration": "1 minute",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_description": "Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Etheral Plane (the spell fails and the casting is wasted if you were already on that plane). <br><br>At the start of you next turn, and when the spell ends if you are on the Etheral Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that rang, you appear in the nearest unoccupied space (chosen at random if more that one space is equally near). You can dismiss this spell as an action. <br><br>While on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can’t see anything more than 60 feet away.You can only affect and be affected by other reatures on the Ethereal Plane. Creature that aren’t there can’t perceive you or interact with you, unless they have the ability to do so."
  },
  {
    "s_id": 40,
    "s_name": "Blur",
    "s_ritual": false,
    "s_school": "Illusion",
    "s_lvl": "2nd",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V",
    "s_duration": "Concentration, up to 1 minute",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesnt rely on sight, as with blindsight, or can see through illusions, as with truesight."
  },
  {
    "s_id": 41,
    "s_name": "Bones of the Earth",
    "s_ritual": false,
    "s_school": "Transmutation",
    "s_lvl": "6th",
    "s_cast_time": "1 action",
    "s_range": "120 feet",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_class_usage": [
      "Druid"
    ],
    "s_type": "Utility",
    "s_description": "You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10-foot radius. The rubble lasts until cleared.<br>If a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save.<br>If a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 6d6 bludgeoning damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature’s choice) against the spell’s saving throw DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.<br><b>At Higher Levels.</b><br> When you cast this spell using a spell slot of 7th level or higher, you can create two additional pillars for each slot level above 6th."
  },
  {
    "s_id": 42,
    "s_name": "Booming Blade",
    "s_ritual": false,
    "s_school": "Evocation",
    "s_lvl": "Cantrip",
    "s_cast_time": "1 action",
    "s_range": "5 feet",
    "s_components": "V, M (a weapon)",
    "s_duration": "1 round",
    "s_class_usage": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_description": "As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell's range, otherwise the spell fails.<br>On a hit, the target suffers the attack's normal effects, and it becomes sheathed in booming energy until the start of your next turn. If the target willingly moves be- fore then, it immediately takes 1d8 thunder damage, and the spell ends.<br>This spell's damage increases when you reach higher levels. <br><br><b>At higher level</b><br>At 5th level, the melee attack deals an extra 1d8 thunder damage to the target, and the damage the target takes for moving increases to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level."
  },
  {
    "s_id": 43,
    "s_name": "Branding Smite",
    "s_ritual": false,
    "s_school": "Evocation",
    "s_lvl": "2nd",
    "s_cast_time": "1 bonus action",
    "s_range": "Self",
    "s_components": "V",
    "s_duration": "Concentration, up to 1 minute",
    "s_class_usage": [
      "Paladin"
    ],
    "s_type": "Damage",
    "s_description": "The next time you hit a creature with a weapon attack before this spell ends, the weapon glemas with astral radiance as you strike. The attack deals an extra 2d6 radiant damage to the target, which becomes visible if it is invisible, and the target sheds dim light in a 5-foot radius and can’t become invisible until the spell ends. <br><br><b>At higher level</b><br>When you cast this spell using a spell slot of 3rd level or higher, the extra damage increases by 1d6 for each slot level above 2nd."
  },
  {
    "s_id": 44,
    "s_name": "Burning Hands",
    "s_ritual": false,
    "s_school": "Evocation",
    "s_lvl": "1st",
    "s_cast_time": "1 action",
    "s_range": "Self (15-foot cone)",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Damage",
    "s_description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. <br><br>The fire ignites any flammable objects in the area that aren’t being worn or carried. <br><br><b>At higher level<b><br>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
  }
]

// https://www.dnd-spells.com/spells