[
  {
    "s_id": 0,
    "s_lvl": "Cantrip",
    "s_class_usage": [
      "Wizard",
      "Sorcerer"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "60 feet",
    "s_components": "V, S",
    "s_duration": "Instantaneous",
    "s_school": "Conjuration",
    "s_ritual": false,
    "s_name": "Acid Splash",
    "s_description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or lake 1d6 acid damage. This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th leveI (3d6), and 17th level (4d6)."
  },
  {
    "s_id": 4,
    "s_lvl": "1st",
    "s_class_usage": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a morsel of food)",
    "s_duration": "24 hours",
    "s_school": "Enchantment",
    "s_ritual": false,
    "s_name": "Animal Friendship",
    "s_description": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spells ends. <br><b>At Higher Levels.</b> When you cast this spell using a spell slot of 2nd leveI or higher, you can affect one additional beast for each slot level above 1st."
  },
  {
    "s_id": 1,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Paladin",
      "Cleric"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a tiny strip of white cloth)",
    "s_duration": "8 hours",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Aid",
    "s_description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration. At Higher LeveIs. When you cast this spell using a spell slot of 3rd leveI or higher, a target's hit points increase by an additional 5 for each slot level above 2nd."
  },
  {
    "s_id": 7,
    "s_lvl": "3rd",
    "s_class_usage": [
      "Cleric",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 minute",
    "s_range": "10 feet",
    "s_components": "V, S, M (a drop of blood, a piece of flesh and a pinch of bone dust)",
    "s_duration": "Instantaneous",
    "s_school": "Necromancy",
    "s_ritual": false,
    "s_name": "Animate Dead",
    "s_description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature's game statistics).<br> On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.<br> The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one.<br> <b>At Higher Levels.</b> When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones."
  },
  {
    "s_id": 8,
    "s_lvl": "5th",
    "s_class_usage": [
      "Bard",
      "Sorcerer"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "120 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 minute",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Animate Objects",
    "s_description": "Objects come to life at your command. Choose up to ten nonmagical objects within range that are not being worn or carried. Medium targets count as two objects, Large targets count as four objects, Huge targets count as eight objects. You can't animate any object larger than Huge. Each target animates and becomes a creature under your control until the spell ends or until reduced to 0 hit points.<br> As a bonus action, you can mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.<br> An animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion, it instead has a f1yingspeed of 30 feet and can hover. If the object is securely attached to a surface or a larger object, such as a chain bolted to a wall, its speed is O. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it reverts to its original object form, and any remaining damage carries over to its original object form.<br> If you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determined by its size. The DM might rule that a specific object inflicts slashing or piercing damage based on its form. <br> <b>At Higher Levels.</b> If you cast this spell using a spell slot of 6th level or higher, you can animate two additional objects for each slot level above 5th."
  },
  {
    "s_id": 2,
    "s_lvl": "1st",
    "s_class_usage": [
      "Ranger",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a tiny bell and a piece of fine silver wire)",
    "s_duration": "8 hours",
    "s_school": "Abjuration",
    "s_ritual": true,
    "s_name": "Alarm",
    "s_description": "You set an alarm against unwanted intrusion. Choose a door. a window, or an area wilhin range that is no larger lhan a 20-foot cube. Until lhe spell ends. an alarm alerts you whenever a Tiny or larger creature touches or enters lhe warded area. When you cast the spell, you can designate creatures lhat won't set off the alarm. You also choose whether the alarm is mental or audible. A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. An audible alarm produces the sound of a hand bell for 10 seconds within 60 feel."
  },
  {
    "s_id": 3,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Self",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Alter Self",
    "s_description": "You assume a different formo When you cast lhe spell. choose one of the following options, the effects of which last for the duralion of the spell. While lhe spell lasts, you can end one option as an aclion lo gain the benefils of a differenl one. <br><b>Aquatic Adaptation</b>. You adapt your body to an aquatic environment, sprouting gills and growing webbing belween your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed. <br><b>Change Appearance.</b> You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair lenglh, coloration, and distinguishing characteristics, if any, You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a differenl size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duralion of the spell, you can use your action to change your appearance in this way again. <br><b>Natural Weapons.</b> You grow claws, fangs, spines, horns, or a differenl natural weapon of your choice. Your unarmed strikes deal ld6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient wilh your unarmed strikes. Finally, lhe natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it."
  },
  {
    "s_id": 5,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a morsel of food)",
    "s_duration": "24 hours",
    "s_school": "Enchantment",
    "s_ritual": true,
    "s_name": "Animal Messenger",
    "s_description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as -a man or woman dressed in the uniform of lhe town guard- or -a red-haired dwarf wearing a pointed hat.- You also speak a message of up twenty-five words. The target beast travels for the duralion of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals. When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell. <br><b>At Higher LeveIs.</b> If you cast this spell using a spell slot of 2nd level or higher, the duration of the spell increases by 48 hours for each slol level above 2nd."
  },
  {
    "s_id": 6,
    "s_lvl": "8th",
    "s_class_usage": [
      "Druid"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 24 hours",
    "s_school": "Transmutation",
    "s_ritual": false,
    "s_name": "Animal Shapes",
    "s_description": "Your magic turns others into beasts. Choose any number of willing creatures that you can see within range. You transform each target into the form of a Large or smaller beast with a challenge rating of 4 or lower. On subsequent turns, you can use your action to transform affected creatures into new forms. The transformation lasts for the duration for each target, or until the target drops to 0 hit points or dies. You can choose a different form for each target. A target's game statistics are replaced by the statistics of the chosen beast, though the target retains its alignment and Intelligence, Wisdom, and Charisma scores. The target assumes the hit points of its new form, and when it reverts to its normal form, it returns to the number of hit points it had before ir rransformed. If it reverts as a result of dropping to 0 hit poinls, any excess damage carries over to its normal form long as the excess damage doesn't reduce the creature's normal form to 0 hit poinlt, it isn't knocked unconscious. The creature is limiled in the actions it can perform by the nature of its new form, and it can't speak or cast spells. <br>The target's gear melds into the new form. The target can't activate, wield, or otherwise benefit from any of its equipment."
  },
  {
    "s_id": 7,
    "s_lvl": "8th",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "150 feet",
    "s_components": "V, S, M (a bit of sponge)",
    "s_duration": "Instantaneous",
    "s_school": "Necromancy",
    "s_ritual": false,
    "s_name": "Abi-Dalzim’s Horrid Wilting",
    "s_description": "You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren’t affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one.</br>Nonmagical plants in the area that aren’t creatures, such as trees and shrubs, wither and die instantly."
  },
  {
    "s_id": 8,
    "s_lvl": "1st",
    "s_class_usage": [
      "Druid",
      "Ranger",
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Support",
    "s_cast_time": "Reaction",
    "s_range": "Self",
    "s_components": "S",
    "s_duration": "1 round",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Absorb Elements",
    "s_description": "1 Reaction, which you take when you take acid, cold, fire, lightning, or thunder damage</br>The spell captures some of the incoming energy, lessening its effect on you and storing it for your next melee attack. You have resistance to the triggering damage type until the start of your next turn. Also, the first time you hit with a melee attack on your next turn, the target takes an extra 1d6 damage of the triggering type, and the spell ends.</br><b>At higher level</b></br>When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st."
  },
  {
    "s_id": 9,
    "s_lvl": "2nd",
    "s_class_usage": [
      "Sorcerer",
      "Wizard"
    ],
    "s_type": "Damage",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a red dragon’s scale)",
    "s_duration": "Instantaneous",
    "s_school": "Evocation",
    "s_ritual": false,
    "s_name": "Aganazzar's Scorcher",
    "s_description": "A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. </br>Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.<br><b>At higher level</b></br>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
  },
  {
    "s_id": 10,
    "s_lvl": "5th",
    "s_class_usage": [
      "Druid"
    ],
    "s_type": "Support",
    "s_cast_time": "1 action",
    "s_range": "Self (10-foot radius)",
    "s_components": "V, S",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Antilife Shell",
    "s_description": "A shimmering barrier extends out from you in a 10-foot radius and moves with you, remaining centered on you and hedging out creatures other than undead and constructs. </br>The barrier lasts for the duration. The barrier prevents an affected creature from passing or reaching through. An affected creature can cast spells or make attacks with ranged or reach weapons through the barrier. </br>If you move so that an affect creature is forced to pass through the barrier, the spell ends."
  },
  {
    "s_id": 11,
    "s_lvl": "8th",
    "s_class_usage": [
      "Cleric",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "Self (10-foot-radius sphere)",
    "s_components": "V, S M (a pinch of powdered iron or iron filings)",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Abjuration",
    "s_ritual": false,
    "s_name": "Antimagic Field",
    "s_description": "A 10-foot-radius invisible sphere of antimagic surrounds you. <br/>This area is divorced from the magical energy that suffeses the multiverse. Within the sphere, spells can’t be cast, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the spere moves with you, centered on you. Spells and other magical effects, except those created by an artifact or a deity, are suppressed in the sphere and can’t protrude into it. A slot expended to cast a suppressed spell is consumed. While an effect is suppressed, it doesn’t function, but the time it spends suppressed counts against its duration. </br><b>Targeted Effects. </b><br>Spells and other magical effects, such as magic missle and charm person, that target a creature or an object in the sphere have no effect on that target. <br><b>Areas of Magic. </b><br>The area of another spell or magical effect, such as fireball, can’t extend into the sphere. If the sphere overlaps an area of magic, the part of the area that is covered by the sphere is suppressed. For example, the flames created by a wall of fire are suppressed within the sphere, creating a gap in the wall if the overlap is large enough. <br><b>Spells. </b><br>Any active spell or other magical effect on a creature or an object in the sphere is suppressed while the creature or object is in it. <br><b>Magic Items. </b><br>The properties and powers of magic items are suppressed in the sphere. Forexample, a +1 longsword in the sphere functions as a nonmagical longsword. A magic weapon’s properties and powers are suppressed if it is used against a target in the sphere or wielded by an attacker in the sphere. If a magic weapon or piece of magic ammunition fully leaves the sphere (For example, if you fire a magic arrow or throw a magic spear at a target outside the sphere), the magic of the item ceases to be supressed as soon as it exits. <br><b>Magical Travel. </b><br>Teleportation and planar travel fail to work in the sphere, whether the sphere is the destination or the departure point for such magical travel. A portal to another location, world, or plane of existence, as well as an opening to an extradimensional space such as that created by the rope trick spells, temporarily closes while in the sphere. <br><b>Creatures and Objects. </b><br>A creature or object summoned or created by magic temporarily winks out of existence in the sphere. Such a creature instantly reappears once the space the creature occupied is no longer withinthe sphere. <br><b>Dispel Magic. </b><br>Spells and magical effects such as dispel magic have no effect on the sphere. Likewise, the spheres created by different antimagic field spells don’t nullify each other."
  },
  {
    "s_id": 12,
    "s_lvl": "8th",
    "s_class_usage": [
      "Druid",
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 hour",
    "s_range": "60 feet",
    "s_components": "V, S, M (either a lump of alum soaked in vinegar for the antipathy effect or a drop of honey for the sympathy effect)",
    "s_duration": "10 days",
    "s_school": "Enchantment",
    "s_ritual": false,
    "s_name": "Antipathy/Sympathy",
    "s_description": "This spell attracts or repels creatures of your choice. <br>You target something within range, either a Huge or smaller object or creature or an area that is no larger than a 200-foot cube. Then specify a kind of intelligent creature, such as red dragons, goblins, or vampires. You invest the target with an aura that either attracts or repels the specified creatures for the duration. Choose antipathy or sympathy as the aura’s effect. <br><b>Antipathy. </b><br>The enchantment causes creatures of the kind you designated to feel an intense urge to leave the area and avoid the target. When such a creature can see the target or comes within 60 feet of it, the creature must succeed on a Wisdom saving throw or become frightened. The creature remains frightened while it can see the target or is within 60 feet of it. While frightened by the target, the creature must use its movement to move to the nearest safe spot from which it can’t see the target. If the creature moves more than 60 feet from the target and can’t see it, the creature is no longer frightened, but the creature becomes frightened again if it regains sight of the target or moves within 60 feet of it. <br><b>Sympathy. </b><br>The enchantment causes the specified creatures to feel an intense urge to approach the target while within 60 feet of it or able to see it. When such a creature can see the target or comes within 60 feet o fit, the creature must succeed on a Wisdom saving throw or use its movement on each of its turns to enter the area or move within reach of the target. When the creature has done so, it can’t willingly move away from the target. If the target damages or otherwise harms an affected creature, the affected creature can make a Wisdom saving throw to end the effect, as described below. <br><b>Ending the Effect. </b><br>If an affected creature ends its turn while not within 60 feet of the target or able to see it, the creature makes a Wisdom saving throw. On a successful save, the creature is no longer affected by the target and recognizes the feeling of repugnance or attraction as magical. In addition, a creature affected by the spell is allowed another Wisdom saving throw every 24 hours while the spell persists. <br>A creature that successfully saves against this effect is immune to it for 1 minute, after which time it can be affected again."
  },
  {
    "s_id": 13,
    "s_lvl": "4th",
    "s_class_usage": [
      "Wizard"
    ],
    "s_type": "Utility",
    "s_cast_time": "1 action",
    "s_range": "30 feet",
    "s_components": "V, S, M (a bit of bat fur)",
    "s_duration": "Concentration, up to 1 hour",
    "s_school": "Divination",
    "s_ritual": false,
    "s_name": "Arcane Eye",
    "s_description": "You create an invisible, magical eye within range that hovers in the air for the duration. <br><br>You mentally receive visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction. <br>As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can’t enter another plane of existence. A solid barrier blocks the eye’s movement, but the eye can pass through an opening as small as 1 inch in diameter."
  }
]
